In [2]:
import pandas as pd
import numpy as np

In [4]:
data = [{'eng':30,'kor':70,'math':100},
       {'eng':40,'kor':80,'math':10},
       {'eng':50,'kor':90,'math':20},
       {'eng':60,'kor':100,'math':30},
       {'eng':70,'kor':10,'math':40}]
df =pd.DataFrame(data,index=['aa','bb','cc','dd','ee'])
df

    eng  kor  math
aa   30   70   100
bb   40   80    10
cc   50   90    20
dd   60  100    30
ee   70   10    40

In [6]:
# 요소별로 연산해줌
df+1

    eng  kor  math
aa   31   71   101
bb   41   81    11
cc   51   91    21
dd   61  101    31
ee   71   11    41

In [11]:
# df[컬럼명] = Series로 니옴
# df[컬럼명].시리즈속성(메소드)
# df['eng'].max()

df['eng']

aa    30
bb    40
cc    50
dd    60
ee    70
Name: eng, dtype: int64

In [13]:
# 데이터 프레임으로 나옴

df[['eng','math']]

    eng  math
aa   30   100
bb   40    10
cc   50    20
dd   60    30
ee   70    40

In [16]:
# 슬라이싱은 row(index) 별로 함
df[1:4]

    eng  kor  math
bb   40   80    10
cc   50   90    20
dd   60  100    30

In [19]:
df['aa':'dd']

    eng  kor  math
aa   30   70   100
bb   40   80    10
cc   50   90    20
dd   60  100    30

In [28]:
# df.loc[부여된 인덱스(row), 부여된 컬럼(columns)]
df.loc['aa':'cc','eng':'kor'] # 슬라이싱 가능

    eng  kor
aa   30   70
bb   40   80
cc   50   90

In [33]:
# 지정 컬럼명 값만 가지고 오고 싶을때 사용
df.loc['bb':'dd',['kor','eng']]

    kor  eng
bb   80   40
cc   90   50
dd  100   60

In [39]:
# 지정하여 값 가지고 오기
df.loc[['aa','cc','dd'],['eng','math']]

    eng  math
aa   30   100
cc   50    20
dd   60    30

In [42]:
# df.iloc[zerobaseindex, zerobase colum]
df.iloc[1:]

    eng  kor  math
bb   40   80    10
cc   50   90    20
dd   60  100    30
ee   70   10    40

In [46]:
# 2행 부터, 2열 부터 끝까지의 값
df.iloc[1:,1:]

    kor  math
bb   80    10
cc   90    20
dd  100    30
ee   10    40

In [47]:
# 2행 부터, 1열(zerobase = 0), 3열의 값 가지고 오기
df.iloc[1:,[0,2]]

    eng  math
bb   40    10
cc   50    20
dd   60    30
ee   70    40